In [ ]:
#FATHIMA IRFANA
#Roll no: 30
#Aim:
#1)a)Load iris dataset into a dataframe
import pandas as pd
from sklearn.datasets import load_iris

# a) Load iris dataset into a dataframe
iris = load_iris()
df = pd.DataFrame(data=iris.data, columns=iris.feature_names)
df['species'] = pd.Categorical.from_codes(iris.target, iris.target_names)

# b) Print shape of dataset, display all columns and their data types
print("Shape of dataset:", df.shape)
print("\nColumns and data types:\n", df.dtypes)

# c) Take descriptive statistics
print("\nDescriptive Statistics:\n", df.describe())

# d) Delete all rows with null values
df = df.dropna()

# e) Select the Species classes, count the number of examples in each class
print("\nSpecies class distribution:\n", df['species'].value_counts())

# f) Map the species classes into 1, 2, and 3
species_mapping = {'setosa': 1, 'versicolor': 2, 'virginica': 3}
df['species_mapped'] = df['species'].map(species_mapping)

# g) Print the standard deviation and mean of Sepal length
print("\nSepal Length Mean:", df['sepal length (cm)'].mean())
print("Sepal Length Std Dev:", df['sepal length (cm)'].std())

Shape of dataset: (150, 5)

Columns and data types:
 sepal length (cm)     float64
sepal width (cm)      float64
petal length (cm)     float64
petal width (cm)      float64
species              category
dtype: object

Descriptive Statistics:
        sepal length (cm)  sepal width (cm)  petal length (cm)  \
count         150.000000        150.000000         150.000000
mean            5.843333          3.057333           3.758000
std             0.828066          0.435866           1.765298
min             4.300000          2.000000           1.000000
25%             5.100000          2.800000           1.600000
50%             5.800000          3.000000           4.350000
75%             6.400000          3.300000           5.100000
max             7.900000          4.400000           6.900000

       petal width (cm)
count        150.000000
mean           1.199333
std            0.762238
min            0.100000
25%            0.300000
50%            1.300000
75%            1.800000
max            2.500000

Species class distribution:
 species
setosa        50
versicolor    50
virginica     50
Name: count, dtype: int64

Sepal Length Mean: 5.843333333333334
Sepal Length Std Dev: 0.8280661279778629

In [ ]:
#2)Create a DataFrame with 4 records having the fields:
#StudentID, RegNo, FullName, Gender, Department, Marks  and Perform the following operations:
import pandas as pd
import numpy as np
data = {
    'StudentID': [201, 202, 203, 204],
    'RegNo': ['R101', 'R102', 'R103', 'R104'],
    'FullName': ['Asha', 'Binu', 'Chitra', 'Deepak'],
    'Gender': ['F', 'M', 'F', 'M'],
    'Department': ['CSE', 'ECE', 'IT', 'ME'],
    'Marks': [87, np.nan, 78, 92]  # one student has a missing mark
}
#a) Insert a new column 'Grade'  into the DataFrame and assign values.
df = pd.DataFrame(data)
df['Grade'] = ['A', 'B', 'C', 'A']
print(df)
#b) Find and display the total no.of rows  in the DataFrame.
print("Total rows:", len(df))
#c) Select the first two rows and the last two rows of the DataFrame.
print("\nFirst two rows:\n", df.head(2))
print("\nLast two rows:\n", df.tail(2))
#d) Drop all rows where any column has a null (NaN) value.
df = df.dropna()
print("\nDataFrame after dropping rows with null values:\n", df)
#e)Remove the 'RegNo column from the DataFrame.
df = df.drop(columns=['RegNo'])
print("\nDataFrame after removing 'RegNo' column:\n", df)
#f) Display the 'FullName' and 'Marks' from rows 3 to 6.
print("\n'FullName' and 'Marks' from rows 3 to 6:\n", df.loc[2:5, ['FullName', 'Marks']])
#g) Replace all null values in 'Marks' column with the median of that column
median_marks = df['Marks'].median()
df['Marks'] = df['Marks'].fillna(median_marks)
print("\nDataFrame after replacing null values in 'Marks' with median:\n", df)

   StudentID RegNo FullName Gender Department  Marks Grade
0        201  R101     Asha      F        CSE   87.0     A
1        202  R102     Binu      M        ECE    NaN     B
2        203  R103   Chitra      F         IT   78.0     C
3        204  R104   Deepak      M         ME   92.0     A
Total rows: 4

First two rows:
    StudentID RegNo FullName Gender Department  Marks Grade
0        201  R101     Asha      F        CSE   87.0     A
1        202  R102     Binu      M        ECE    NaN     B

Last two rows:
    StudentID RegNo FullName Gender Department  Marks Grade
2        203  R103   Chitra      F         IT   78.0     C
3        204  R104   Deepak      M         ME   92.0     A

DataFrame after dropping rows with null values:
    StudentID RegNo FullName Gender Department  Marks Grade
0        201  R101     Asha      F        CSE   87.0     A
2        203  R103   Chitra      F         IT   78.0     C
3        204  R104   Deepak      M         ME   92.0     A

DataFrame after removing 'RegNo' column:
    StudentID FullName Gender Department  Marks Grade
0        201     Asha      F        CSE   87.0     A
2        203   Chitra      F         IT   78.0     C
3        204   Deepak      M         ME   92.0     A

'FullName' and 'Marks' from rows 3 to 6:
   FullName  Marks
2   Chitra   78.0
3   Deepak   92.0

DataFrame after replacing null values in 'Marks' with median:
    StudentID FullName Gender Department  Marks Grade
0        201     Asha      F        CSE   87.0     A
2        203   Chitra      F         IT   78.0     C
3        204   Deepak      M         ME   92.0     A